# Αριθμητική Επεξεργασία και Διαχείριση Στοιχείων Πίνακα σε MIPS
# Ο παραπάνω κώδικας αρχικοποιεί τις μεταβλητές $s0-$s5 και $s8 με συγκεκριμένες τιμές (a, d, c, 10, e, f, x).
# Εκχωρείται η τιμή του B[16] στον καταχωρητή $t0. 
# Στη συνέχεια, προστίθενται οι τιμές του B[16] και της μεταβλητής x, και η αποτελούμενη  τιμή αποθηκεύεται στη μεταβλητή c.
# Προστίθενται οι τιμές των μεταβλητών a και d, και η αποτελούμενη τιμή αποθηκεύεται στο B[8]. 
# Στη συνέχεια, αφαιρείται η τιμή του A[4] από τη μεταβλητή a, και το αποτέλεσμα αποθηκεύεται στο B[12].
# Τέλος, αποθηκεύονται τα αποτελέσματα των υπολογισμών στους καταχωρητές B[16], B[8], και B[12].

 .data
A:  .space 16     # Διεύθυνση βάσης του A
B:  .space 64     # Διεύθυνση βάσης του B

    .text
    .globl main

main:
    # Αρχικοποίηση διευθύνσεων βάσης (Απαραίτητο για να λειτουργήσουν τα lw/sw)
    la $s6, A      # $s6 = διεύθυνση του πίνακα A
    la $s7, B      # $s7 = διεύθυνση του πίνακα B

    # Αρχικοποίηση των καταχωρητών $s0-$s5 με τις αρχικές τιμές
    li $s0, 7      # $s0 = a
    li $s1, 8      # $s1 = d
    li $s2, 0      # $s2 = c
    li $s3, 10     # $s3 = 10
    li $s4, 0      # $s4 = e
    li $s5, 0      # $s5 = f
    li $s8, 0      # $s8 = x

    # Φόρτωση της τιμής του B[16] στον καταχωρητή $t0
    lw $t0, 64($s7)

    # Πρόσθεση των τιμών του B[16] και της μεταβλητής x στον καταχωρητή $s2
    add $s2, $t0, $s8

    # Πρόσθεση της τιμής της μεταβλητής x στην μεταβλητή c
    add $s2, $s2, $s8

    # Πρόσθεση της τιμής του B[16] στην μεταβλητή a    
    add $s0, $s0, $t0
 
    # Πρόσθεση των τιμών 10 και 8 στην μεταβλητή d   
    add $s1, $s1, $s3
    
    # Πρόσθεση των τιμών της μεταβλητής e και της μεταβλητής a, στην μεταβλητή f  
    add $s5, $s4, $s0
    
    # Αφαίρεση της τιμής του A[4] από την μεταβλητή a   
    lw $t1, 16($s6)   
    sub $s0, $s0, $t1
    
    # Αποθήκευση του αποτελέσματος c - 5 στο B[16]   
    sub $s2, $s2, 5   
    sw $s2, 64($s7)    
    
    # Αποθήκευση του αποτελέσματος d + a στο B[8]    
    add $s1, $s1, $s0   
    sw $s1, 32($s7) 
    
    # Αποθήκευση του αποτελέσματος a - A[4] στο B[12]   
    sw $s0, 48($s7)    
    
    # Έξοδος από το πρόγραμμα    
    li $v0, 10
    syscall
