Σύνοψη Βασικών Εννοιών και Ερωτήσεων MIPS Assembly

"1.  Ποια η διαφορά lw και sw;"
H sw αποθηκεύει δεδομένα στην μνήμη ενώ η lw διαβάζει τα δεδομένα της μνήμης.

"2.   Με ποιο/ους καταχωρητή/ες αρχικοποιούμε με 0;"
Καταχωρητής 0 (zero)  εργ5 σελ 40

"3.   Με ποια εντολή μπορούμε να προσθέσουμε άμεσα σε ένα καταχωρητή την τιμή 10;"
add

"4.   Ποια η διαφορά R και I Format (αναλυτικά και πρακτικά);"
Οι εντολές R-format χρησιμοποιούνται για λειτουργίες που εφαρμόζονται σε δύο καταχωρητές (registers). Συνήθως περιλαμβάνει έναν κωδικό λειτουργίας (opcode), 
καθώς και τους αριθμούς εγγραφής δύο πηγών και τον αριθμό εγγραφής προορισμού.
Οι εντολές I-format χρησιμοποιούνται για λειτουργίες που εφαρμόζονται σε έναν καταχωρητή και μια άμεση (immediate) τιμή . Συνήθως περιλαμβάνει έναν κωδικό λειτουργίας (opcode), 
τον αριθμό του καταχωρητή προορισμού και την άμεση τιμή.

"5.   Ποιες εντολές (που έχουμε μάθει μέχρι τώρα) ανήκουν στο I και R Format αντίστοιχα;"
R :  Add, sub              
I:  Add immediate,  lw,  sw

"6.   Στην assembly για mips υπάρχουν ειδικοί καταχωρητές για προκαθορισμένες λειτουργίες – αναθέσεις;"
Yπάρχουν ειδικοί καταχωρητές που χρησιμοποιούνται για συγκεκριμένες λειτουργίες ή αναθέσεις. Ορισμένοι από αυτούς τους ειδικούς καταχωρητές $zero και καταχωρητές κατάστασης (status registers), 
όπως οι $at, $v0, $v1, $a0-$a3, $t0-$t9, $s0-$s7, $k0, και $k1.

"7.   Η δυαδική συμβατότητα τι πλεονέκτημα μας δίνει;"
Επιτρέπει στα µεταγλωττισµένα προγράµµατα να εκτελούνται σε διαφορετικούς υπολογιστές.

